//경부
var 한남 = 0, 반포 = 1, 서초 = 2, 양재 = 3, 판교 = 4, 신갈 = 5, 수원 = 6, 기흥 = 7, 동탄 = 8, 오산 = 9;
var 안성 = 10, 천안 = 11, 목천 = 12, 청주 = 13, 남이 = 14, 청원 = 15, 신탄진 = 16, 회덕 = 17, 대전 = 18, 비룡 = 19;
var 옥천 = 20, 금강 = 21, 영동 = 22, 황간 = 23, 추풍령 = 24, 김천 = 25, 구미 = 26, 남구미 = 27, 왜관 = 28, 칠곡 = 29;
var 금호 = 30, 북대구 = 31, 도동 = 32, 동대구 = 33, 경산 = 34, 영천 = 35, 건천 = 36, 경주 = 37, 언양 = 38, 서울산 = 39;
var 통도사 = 40, 양산 = 41, 노포 = 42, 영락 = 43, 구서 = 44;

//중부
var 하남 = 45, 산곡jc = 46, 곤지암jc = 47, 서이천 = 48, 마장jc = 49;
var 호법jc = 50, 일죽 = 51, 음성 = 52, 대소jc = 53, 진천 = 54, 증평 = 55, 오창 = 56, 서청주 = 57;
var 판암 = 58, 산내jc = 59, 남대전 = 60, 추부 = 61, 금산 = 62, 무주 = 63, 덕유산 = 64, 장수jc = 65, 서상 = 66, 지곡 = 67;
var 함양jc = 68, 생초 = 69, 산청 = 70, 단성 = 71, 서진주 = 72, 진주jc = 73, 연화산 = 74, 고성 = 75, 동고성 = 76, 북통영 = 77;
var 통영 = 78;

//영동
var 서창JC=79, 월곶JC=80, 서안산IC=81, 안산IC=82, 안산JC=83, 둔대IC=84, 군포IC=85, 동군포IC=86;
var 부곡IC=87, 북수원IC=88, 동수원IC=89, 마성IC=90, 용인IC=91, 양지IC=92, 덕평IC=93;
var 이천IC=94, 여주JC=95, 여주IC=96, 문막IC=97, 만종JC=98, 원주IC=99;
var 새말IC=100, 둔내IC=101, 면온IC=102, 장평IC=103, 속사IC=104, 진부IC=105, 강릉JC=106;
 
//호남
var 남천안ic = 107, 정안ic = 108, 북공주jc = 109;
var 공주jc = 110, 남공주ic = 111, 탄천ic = 112, 서논산ic = 113, 연무ic = 114, 논산jc = 115, 익산ic = 116, 익산jc = 117, 삼례ic = 118, 전주ic = 119;
var 서전주ic = 120, 김제ic = 121, 금산사ic = 122, 태인ic = 123, 정읍ic = 124, 내장산ic = 125, 백양사ic = 126, 장성jc = 127, 장성ic = 128, 광산ic = 129;
var 신월ic = 130, 동림ic = 131, 서광주ic = 132, 동광주ic = 133, 문흥jc = 134, 고서jc = 135, 창평ic = 136, 대덕jc = 137, 옥과ic = 138, 곡성ic = 139;
var 석곡ic = 140, 주암ic = 141, 승수ic = 142, 서순천ic = 143;

function graph() {
	var v = [];

	addV(v, '한남', 37.521712, 127.017676);
	addV(v, '반포', 37.503138, 127.018604);
	addV(v, '서초', 37.483389, 127.025943);
	addV(v, '양재', 37.463345, 127.039933);
	addV(v, '판교JC', 37.405781, 127.094672);
	addV(v, '신갈JC', 37.289948, 127.103641);
	addV(v, '수원', 37.266949, 127.10362);
	addV(v, '기흥', 37.216557, 127.097161);
	addV(v, '동탄JC', 37.177586, 127.095895);
	addV(v, '오산', 37.143453, 127.084222);
	addV(v, '안성JC', 37.035961, 127.13881);
	addV(v, '천안JC', 36.767973, 127.180803);
	addV(v, '목천', 36.759705, 127.217925);
	addV(v, '청주', 36.62624, 127.383342);
	addV(v, '남이JC', 36.597424, 127.420785); //
	addV(v, '청원JC', 36.564651, 127.430849);
	addV(v, '신탄진', 36.440083, 127.419777);
	addV(v, '회덕JC', 36.40436, 127.419176);
	addV(v, '대전', 36.363125, 127.451234);
	addV(v, '비룡JC', 36.345135, 127.482305); //
	addV(v, '옥천', 36.316837, 127.557878);
	addV(v, '금강', 36.279223, 127.668965);
	addV(v, '영동', 36.269708, 127.832923);
	addV(v, '황간', 36.222067, 127.906051);
	addV(v, '추풍령', 36.19956, 128.001902);
	addV(v, '김천JC', 36.159516, 128.266389);
	addV(v, '구미', 36.108756, 128.360803);
	addV(v, '남구미', 36.069967, 128.369408);
	addV(v, '왜관', 35.97719, 128.432493);
	addV(v, '칠곡', 35.956923, 128.455174);
	addV(v, '금호', 35.956923, 128.455174);
	addV(v, '북대구', 35.909161, 128.581302);
	addV(v, '도동JC', 35.912741, 128.662562);
	addV(v, '동대구JC', 35.886651, 128.692775);
	addV(v, '경산', 35.876932, 128.78839);
	addV(v, '영천', 35.922368, 128.95134);
	addV(v, '건천', 35.842952, 129.085708);
	addV(v, '경주', 35.807616, 129.184713);
	addV(v, '언양JC', 35.566602, 129.129868);
	addV(v, '서울산', 35.553195, 129.123688);
	addV(v, '통도사', 35.49967, 129.095535);
	addV(v, '양산JC', 35.334733, 129.040132);
	addV(v, '노포', 35.287158, 129.100299);
	addV(v, '영락', 35.275142, 129.108474);
	addV(v, '구서', 35.250911, 129.097767);

	
	addE(v[한남], [ v[반포] ]);
	addE(v[반포], [ v[한남], v[서초] ]);
	addE(v[서초], [ v[반포], v[양재] ]);
	addE(v[양재], [ v[서초], v[판교] ]);
	addE(v[판교], [ v[양재], v[신갈] ]);
	addE(v[신갈], [ v[판교], v[수원] ]);
	addE(v[수원], [ v[신갈], v[기흥] ]);
	addE(v[기흥], [ v[수원], v[동탄] ]);
	addE(v[동탄], [ v[기흥], v[오산] ]);
	addE(v[오산], [ v[동탄], v[안성] ]);
	addE(v[안성], [ v[오산], v[천안] ]);
	addE(v[천안], [ v[안성], v[목천] ]);
	addE(v[목천], [ v[천안], v[청주] ]);
	addE(v[청주], [ v[목천], v[남이] ]);
	addE(v[남이], [ v[청주], v[청원] ]);
	addE(v[청원], [ v[남이], v[신탄진] ]);
	addE(v[신탄진], [ v[청원], v[회덕] ]);
	addE(v[회덕], [ v[신탄진], v[대전] ]);
	addE(v[대전], [ v[회덕], v[비룡] ]);
	addE(v[비룡], [ v[대전], v[옥천] ]);
	addE(v[옥천], [ v[비룡], v[금강] ]);
	addE(v[금강], [ v[옥천], v[영동] ]);
	addE(v[영동], [ v[금강], v[황간] ]);
	addE(v[황간], [ v[영동], v[추풍령] ]);
	addE(v[추풍령], [ v[황간], v[김천] ]);
	addE(v[김천], [ v[추풍령], v[구미] ]);
	addE(v[구미], [ v[김천], v[남구미] ]);
	addE(v[남구미], [ v[구미], v[왜관] ]);
	addE(v[왜관], [ v[남구미], v[칠곡] ]);
	addE(v[칠곡], [ v[왜관], v[금호] ]);
	addE(v[금호], [ v[칠곡], v[북대구] ]);
	addE(v[북대구], [ v[금호], v[도동] ]);
	addE(v[도동], [ v[북대구], v[동대구] ]);
	addE(v[동대구], [ v[도동], v[경산] ]);
	addE(v[경산], [ v[동대구], v[영천] ]);
	addE(v[영천], [ v[경산], v[건천] ]);
	addE(v[건천], [ v[영천], v[경주] ]);
	addE(v[경주], [ v[건천], v[언양] ]);
	addE(v[언양], [ v[경주], v[서울산] ]);
	addE(v[서울산], [ v[언양], v[통도사] ]);
	addE(v[통도사], [ v[서울산], v[양산] ]);
	addE(v[양산], [ v[통도사], v[노포] ]);
	addE(v[노포], [ v[양산], v[영락] ]);
	addE(v[영락], [ v[노포], v[구서] ]);
	addE(v[구서], [ v[영락] ]);

	addV(v, '하남', 37.525954, 127.219985);
	addV(v, '산곡jc', 37.481942, 127.242107);
	addV(v, '곤지암jc', 37.351942, 127.321243);
	addV(v, '서이천', 37.277536, 127.391024);
	addV(v, '마장jc', 37.257932, 127.411194);
	addV(v, '호법jc', 37.236137, 127.426901); // 영동
	addV(v, '일죽', 37.09131, 127.450622);
	addV(v, '음성', 36.981412, 127.470827);
	addV(v, '대소jc', 36.941487, 127.472885);
	addV(v, '진천', 36.869253, 127.475076);
	addV(v, '증평', 36.772363, 127.502764);
	addV(v, '오창', 36.715239, 127.442954);
	addV(v, '서청주', 36.652837, 127.42148);
	//addV(v, '남이jc', 36.597303, 127.421193); // 경부
	//addV(v, '비룡jc', 36.34351, 127.481875); //경부
	addV(v, '판암', 36.317234, 127.472423);
	addV(v, '산내jc', 36.282086, 127.451116);
	addV(v, '남대전', 36.265081, 127.474033);
	addV(v, '추부', 36.193365, 127.48544);
	addV(v, '금산', 36.103714, 127.519912);
	addV(v, '무주', 35.977926, 127.645294);
	addV(v, '덕유산', 35.842295, 127.646491);
	addV(v, '장수jc', 35.731323, 127.606451);
	addV(v, '서상', 35.665734, 127.673865);
	addV(v, '지곡', 35.587826, 127.770253);
	addV(v, '함양jc', 35.534854, 127.769824);
	addV(v, '생초', 35.481916, 127.824359);
	addV(v, '산청', 35.427735, 127.859874);
	addV(v, '단성', 35.289698, 127.952651);
	addV(v, '서진주', 35.183472, 128.040942);
	addV(v, '진주jc', 35.138215, 128.097818);
	addV(v, '연화산', 35.082531, 128.191596);
	addV(v, '고성', 35.007953, 128.349428);
	addV(v, '동고성', 34.972243, 128.383916);
	addV(v, '북통영', 34.890311, 128.412766);
	addV(v, '통영', 34.86656, 128.442517);


	addE(v[하남], [ v[산곡jc] ]);
	addE(v[산곡jc], [ v[하남], v[곤지암jc] ]);
	addE(v[곤지암jc], [ v[산곡jc], v[서이천] ]);
	addE(v[서이천], [ v[곤지암jc], v[마장jc] ]);
	addE(v[마장jc], [ v[서이천], v[호법jc] ]);
	addE(v[호법jc], [ v[마장jc], v[일죽] ]);
	addE(v[일죽], [ v[호법jc], v[음성] ]);
	addE(v[음성], [ v[일죽], v[대소jc] ]);
	addE(v[대소jc], [ v[음성], v[진천] ]);
	addE(v[진천], [ v[대소jc], v[증평] ]);
	addE(v[증평], [ v[진천], v[오창] ]);
	addE(v[오창], [ v[증평], v[서청주] ]);
	addE(v[서청주], [ v[오창], v[남이] ]);
	addE(v[남이], [ v[서청주] ]); //
	addE(v[비룡], [ v[판암] ]); //
	addE(v[판암], [ v[비룡], v[산내jc] ]);
	addE(v[산내jc], [ v[판암], v[남대전] ]);
	addE(v[남대전], [ v[산내jc], v[추부] ]);
	addE(v[추부], [ v[남대전], v[금산] ]);
	addE(v[금산], [ v[추부], v[무주] ]);
	addE(v[무주], [ v[금산], v[덕유산] ]);
	addE(v[덕유산], [ v[무주], v[장수jc] ]);
	addE(v[장수jc], [ v[덕유산], v[서상] ]);
	addE(v[서상], [ v[장수jc], v[지곡] ]);
	addE(v[지곡], [ v[서상], v[함양jc] ]);
	addE(v[함양jc], [ v[지곡], v[생초] ]);
	addE(v[생초], [ v[함양jc], v[산청] ]);
	addE(v[산청], [ v[생초], v[단성] ]);
	addE(v[단성], [ v[산청], v[서진주] ]);
	addE(v[서진주], [ v[단성], v[진주jc] ]);
	addE(v[진주jc], [ v[서진주], v[연화산] ]);
	addE(v[연화산], [ v[진주jc], v[고성] ]);
	addE(v[고성], [ v[연화산], v[동고성] ]);
	addE(v[동고성], [ v[고성], v[북통영] ]);
	addE(v[북통영], [ v[동고성], v[통영] ]);
	addE(v[통영], [ v[북통영] ]);

	
	
	addV(v,'서창JC',37.432818,126.738453); 
	addV(v,'월곶JC',37.387583,126.7524);
	addV(v,'서안산IC',37.350987,126.80392); 
	addV(v,'안산IC',37.348207,126.838853);
	addV(v,'안산JC',37.344138,126.860461); 
	addV(v,'둔대IC',37.322342,126.905378);
	addV(v,'군포IC',37.326002,126.922603);
	addV(v,'동군포IC',37.328805,126.936813);
	addV(v,'부곡IC',37.328805,126.936813);
	addV(v,'북수원IC',37.318635,126.990876);
	addV(v,'동수원IC',37.299627,127.050297);
	//addV(v,'신갈JC',37.290067,127.103577); //경부
	addV(v,'마성IC',37.283529,127.176498); 
	addV(v,'용인IC',37.256711,127.209663);
	addV(v,'양지IC',37.239389,127.294376); 
	addV(v,'덕평IC',37.241279,127.365189);
	//addV(v,'호법JC',37.236017,127.426751); //중부
	addV(v,'이천IC',37.236017,127.426751); 
	addV(v,'여주JC',37.232131,127.590108); //중부내륙
	addV(v,'여주IC',37.252826,127.653558); 
	addV(v,'문막IC',37.311894,127.826614); 
	addV(v,'만종JC',37.36499,127.902274);
	addV(v,'원주IC',37.400889,127.950211); 
	addV(v,'새말IC',37.446793,128.065808);
	addV(v,'둔내IC',37.492443,128.205149); 
	addV(v,'면온IC',37.561295,128.36584);
	addV(v,'장평IC',37.590476,128.413855); 
	addV(v,'속사IC',37.63053,128.489748);
	addV(v,'진부IC',37.652173,128.562457); 
	addV(v,'강릉JC',37.772809,128.832829);

	addE( v[서창JC], [v[월곶JC]] ); 
	addE( v[월곶JC], [v[서창JC],v[서안산IC]] ); 
	addE( v[서안산IC], [v[월곶JC],v[안산IC]] ); 
	addE( v[안산IC], [v[서안산IC],v[안산JC]] ); 
	addE( v[안산JC], [v[안산IC],v[둔대IC]] ); 
	addE( v[둔대IC], [v[안산JC],v[군포IC]] ); 
	addE( v[군포IC], [v[둔대IC],v[동군포IC]] ); 
	addE( v[동군포IC], [v[군포IC],v[부곡IC]] ); 
	addE( v[부곡IC], [v[동군포IC],v[북수원IC]] ); 
	addE( v[북수원IC], [v[부곡IC],v[동수원IC]] );
	addE( v[동수원IC], [v[북수원IC],v[신갈]] );
	addE( v[신갈], [v[동수원IC],v[마성IC]] ); //
	addE( v[마성IC], [v[신갈],v[용인IC]] );
	addE( v[용인IC], [v[마성IC],v[양지IC]] ); 
	addE( v[양지IC], [v[용인IC],v[덕평IC]] );
	addE( v[덕평IC], [v[양지IC],v[호법jc]] ); 
	addE( v[호법jc], [v[덕평IC],v[이천IC]] ); //
	addE( v[이천IC], [v[호법jc],v[여주JC]] ); 
	addE( v[여주JC], [v[이천IC],v[여주IC]] );
	addE( v[여주IC], [v[여주JC],v[문막IC]] );
	addE( v[문막IC], [v[여주IC],v[만종JC]] ); 
	addE( v[만종JC], [v[문막IC],v[원주IC]] );
	addE( v[원주IC], [v[만종JC],v[새말IC]] ); 
	addE( v[새말IC], [v[원주IC],v[둔내IC]] );
	addE( v[둔내IC], [v[새말IC],v[면온IC]] ); 
	addE( v[면온IC], [v[둔내IC],v[장평IC]] );
	addE( v[장평IC], [v[면온IC],v[속사IC]] );
	addE( v[속사IC], [v[장평IC],v[진부IC]] );
	addE( v[진부IC], [v[속사IC],v[강릉JC]] ); 
	addE( v[강릉JC], [v[진부IC]] );


	

	//addV(v,'천안jc',36.767973,127.180803); 
	addV(v,'남천안ic',36.75472,127.164967);
	addV(v,'정안ic',36.625013,127.120324);
	addV(v,'북공주jc',36.500219,127.102021);
	addV(v,'공주jc',36.491473,127.121601);
	addV(v,'남공주ic',36.426428,127.081025);
	addV(v,'탄천ic',36.298888,127.067399);
	addV(v,'서논산ic',36.224534,127.053097);
	addV(v,'연무ic',36.147682,127.060361);
	addV(v,'논산jc',36.081673,127.102504);
	addV(v,'익산ic',35.991792,127.113748); 
	addV(v,'익산jc',35.943165,127.090015);
	addV(v,'삼례ic',35.925235,127.079287);
	addV(v,'전주ic',35.879071,127.055597);
	addV(v,'서전주ic',35.82653,127.033432); 
	addV(v,'김제ic',35.77526,127.001846);
	addV(v,'금산사ic',35.736489,126.988875);
	addV(v,'태인ic',35.661167,126.927302); 
	addV(v,'정읍ic',35.579761,126.832502);
	addV(v,'내장산ic',35.509907,126.802289);
	addV(v,'백양사ic',35.428321,126.80362);
	addV(v,'장성jc',35.329972,126.804564);
	addV(v,'장성ic',35.285503,126.786915);
	addV(v,'광산ic',35.217111,126.827996);
	addV(v,'신월ic',35.203103,126.83939);
	addV(v,'동림ic',35.192784,126.864088);
	addV(v,'서광주ic',35.184875,126.882799);
	addV(v,'동광주ic',35.184945,126.927817);
	addV(v,'문흥jc',35.192977,126.929297); 
	addV(v,'고서jc',35.224254,126.960078);
	addV(v,'창평ic',35.234596,127.004764);
	addV(v,'대덕jc',35.246706,127.035127);
	addV(v,'옥과ic',35.258936,127.113469);
	addV(v,'곡성ic',35.226673,127.222517); 
	addV(v,'석곡ic',35.12835,127.247171);
	addV(v,'주암ic',35.067255,127.270474);
	addV(v,'승주ic',35.01455,127.374737);
	addV(v,'서순천ic',35.003091,127.482455);



	addE( v[천안], [ v[남천안ic] ]);
	addE( v[남천안ic], [v[천안],v[정안ic]] ); 
	addE( v[정안ic], [v[남천안ic],v[북공주jc]] ); 
	addE( v[북공주jc], [v[정안ic],v[공주jc]] ); 
	addE( v[공주jc], [v[북공주jc],v[남공주ic]] ); 
	addE( v[남공주ic], [v[공주jc],v[탄천ic]] ); 
	addE( v[탄천ic], [v[남공주ic],v[서논산ic]] ); 
	addE( v[서논산ic], [v[탄천ic],v[연무ic]] ); 
	addE( v[연무ic], [v[서논산ic],v[논산jc]] );
	addE( v[논산jc], [v[연무ic],v[익산ic]] ); 
	addE( v[익산ic], [v[논산jc],v[익산jc]] ); 
	addE( v[익산jc], [v[익산ic],v[삼례ic]] ); 
	addE( v[삼례ic], [v[익산jc],v[전주ic]] ); 
	addE( v[전주ic], [v[삼례ic],v[서전주ic]] ); 
	addE( v[서전주ic], [v[전주ic],v[김제ic]] ); 
	addE( v[김제ic], [v[서전주ic],v[금산사ic]] ); 
	addE( v[금산사ic], [v[김제ic],v[태인ic]] ); 
	addE( v[태인ic], [v[금산사ic],v[정읍ic]] );
	addE( v[정읍ic], [v[태인ic],v[내장산ic]] );
	addE( v[내장산ic], [v[정읍ic],v[백양사ic]] );
	addE( v[백양사ic], [v[내장산ic],v[장성jc]] ); 
	addE( v[장성jc], [v[백양사ic],v[장성ic]] ); 
	addE( v[장성ic], [v[장성jc],v[광산ic]] ); 
	addE( v[광산ic], [v[장성ic],v[신월ic]] ); 
	addE( v[신월ic], [v[광산ic],v[동림ic]] );
	addE( v[동림ic], [v[신월ic],v[서광주ic]] ); 
	addE( v[서광주ic], [v[동림ic],v[동광주ic]] ); 
	addE( v[동광주ic], [v[서광주ic],v[문흥jc]] ); 
	addE( v[문흥jc], [v[동광주ic],v[고서jc]] ); 
	addE( v[고서jc], [v[문흥jc],v[창평ic]] ); 
	addE( v[창평ic], [v[고서jc],v[대덕jc]] ); 
	addE( v[대덕jc], [v[창평ic],v[옥과ic]] ); 
	addE( v[옥과ic], [v[대덕jc],v[곡성ic]] );
	addE( v[곡성ic], [v[옥과ic],v[석곡ic]] );
	addE( v[석곡ic], [v[곡성ic],v[주암ic]] );
	addE( v[주암ic], [v[석곡ic],v[승수ic]] ); 
	addE( v[승수ic], [v[주암ic],v[서순천ic]] ); 
	addE( v[서순천ic], [v[승수ic]] ); 
	
	return v;
}
